dkyazzentwatwa/cardputer-app-bundle/ESP32-Bit-Pirate/lib/RF24/RF24.cpp
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "nRF24L01.h"
#include "RF24_config.h"
#include "RF24.h"

/****************************************************************************/

void RF24::csn(bool mode)
{
#if defined(RF24_TINY)
    if (ce_pin != csn_pin) {
        digitalWrite(csn_pin, mode);
    }
    else {
        if (mode == HIGH) {
            PORTB |= (1 << PINB2);                         // SCK->CSN HIGH
            delayMicroseconds(RF24_CSN_SETTLE_HIGH_DELAY); // allow csn to settle.
        }
        else {
            PORTB &= ~(1 << PINB2);                       // SCK->CSN LOW
            delayMicroseconds(RF24_CSN_SETTLE_LOW_DELAY); // allow csn to settle
        }
    }
    // Return, CSN toggle complete
    return;

#elif defined(ARDUINO) && !defined(RF24_SPI_TRANSACTIONS)
    // Minimum ideal SPI bus speed is 2x data rate
    // If we assume 2Mbs data rate and 16Mhz clock, a
    // divider of 4 is the minimum we want.
    // CLK:BUS 8Mhz:2Mhz, 16Mhz:4Mhz, or 20Mhz:5Mhz

    #if !defined(SOFTSPI)
        // applies to SPI_UART and inherent hardware SPI
        #if defined(RF24_SPI_PTR)
    _spi->setBitOrder(MSBFIRST);
    _spi->setDataMode(SPI_MODE0);

            #if !defined(F_CPU) || F_CPU < 20000000
    _spi->setClockDivider(SPI_CLOCK_DIV2);
            #elif F_CPU < 40000000
    _spi->setClockDivider(SPI_CLOCK_DIV4);
            #elif F_CPU < 80000000
    _spi->setClockDivider(SPI_CLOCK_DIV8);
            #elif F_CPU < 160000000
    _spi->setClockDivider(SPI_CLOCK_DIV16);
            #elif F_CPU < 320000000
    _spi->setClockDivider(SPI_CLOCK_DIV32);
            #elif F_CPU < 640000000
    _spi->setClockDivider(SPI_CLOCK_DIV64);
            #elif F_CPU < 1280000000
    _spi->setClockDivider(SPI_CLOCK_DIV128);
            #else // F_CPU >= 1280000000
                #error "Unsupported CPU frequency. Please set correct SPI divider."
            #endif // F_CPU to SPI_CLOCK_DIV translation

        #else // !defined(RF24_SPI_PTR)
    _SPI.setBitOrder(MSBFIRST);
    _SPI.setDataMode(SPI_MODE0);

            #if !defined(F_CPU) || F_CPU < 20000000
    _SPI.setClockDivider(SPI_CLOCK_DIV2);
            #elif F_CPU < 40000000
    _SPI.setClockDivider(SPI_CLOCK_DIV4);
            #elif F_CPU < 80000000
    _SPI.setClockDivider(SPI_CLOCK_DIV8);
            #elif F_CPU < 160000000
    _SPI.setClockDivider(SPI_CLOCK_DIV16);
            #elif F_CPU < 320000000
    _SPI.setClockDivider(SPI_CLOCK_DIV32);
            #elif F_CPU < 640000000
    _SPI.setClockDivider(SPI_CLOCK_DIV64);
            #elif F_CPU < 1280000000
    _SPI.setClockDivider(SPI_CLOCK_DIV128);
            #else // F_CPU >= 1280000000
                #error "Unsupported CPU frequency. Please set correct SPI divider."
            #endif // F_CPU to SPI_CLOCK_DIV translation
        #endif     // !defined(RF24_SPI_PTR)
    #endif         // !defined(SOFTSPI)

#elif defined(RF24_RPi)
    if (!mode)
        _SPI.chipSelect(csn_pin);
#endif // defined(RF24_RPi)

#if !defined(RF24_LINUX)
    digitalWrite(csn_pin, mode);
    delayMicroseconds(csDelay);
#else
    static_cast<void>(mode); // ignore -Wunused-parameter
#endif // !defined(RF24_LINUX)
}

/****************************************************************************/

void RF24::ce(bool level)
{
#ifndef RF24_LINUX
    //Allow for 3-pin use on ATTiny
    if (ce_pin != csn_pin) {
#endif
        digitalWrite(ce_pin, level);
#ifndef RF24_LINUX
    }
#endif
}

/****************************************************************************/

inline void RF24::beginTransaction()
{
    csn(HIGH);
    csn(LOW);
#if defined(RF24_SPI_TRANSACTIONS)
    #if defined(RF24_SPI_PTR)
        #if defined(RF24_RP2)
    _spi->beginTransaction(spi_speed);
        #else  // ! defined (RF24_RP2)
    _spi->beginTransaction(SPISettings(spi_speed, MSBFIRST, SPI_MODE0));
        #endif // ! defined (RF24_RP2)
    #else      // !defined(RF24_SPI_PTR)
    _SPI.beginTransaction(SPISettings(spi_speed, MSBFIRST, SPI_MODE0));
    #endif     // !defined(RF24_SPI_PTR)
#endif         // defined (RF24_SPI_TRANSACTIONS)
}

/****************************************************************************/

inline void RF24::endTransaction()
{
#if defined(RF24_SPI_TRANSACTIONS)
    #if defined(RF24_SPI_PTR)
    _spi->endTransaction();
    #else  // !defined(RF24_SPI_PTR)
    _SPI.endTransaction();
    #endif // !defined(RF24_SPI_PTR)
#endif     // defined (RF24_SPI_TRANSACTIONS)
    csn(HIGH);
}

/****************************************************************************/

void RF24::read_register(uint8_t reg, uint8_t* buf, uint8_t len)
{
#if defined(RF24_LINUX) || defined(RF24_RP2)
    beginTransaction(); //configures the spi settings for RPi, locks mutex and setting csn low
    uint8_t* prx = spi_rxbuff;
    uint8_t* ptx = spi_txbuff;
    uint8_t size = static_cast<uint8_t>(len + 1); // Add register value to transmit buffer

    *ptx++ = reg;

    while (len--) {
        *ptx++ = nRF24L01::NOP; // Dummy operation, just for reading
    }

    #if defined(RF24_RP2)
    _spi->transfernb((const uint8_t*)spi_txbuff, spi_rxbuff, size);
    #else  // !defined (RF24_RP2)
    _SPI.transfernb(reinterpret_cast<char*>(spi_txbuff), reinterpret_cast<char*>(spi_rxbuff), size);
    #endif // !defined (RF24_RP2)

    status = *prx++; // status is 1st byte of receive buffer

    // decrement before to skip status byte
    while (--size) {
        *buf++ = *prx++;
    }

    endTransaction(); // unlocks mutex and setting csn high

#else // !defined(RF24_LINUX) && !defined(RF24_RP2)

    beginTransaction();
    #if defined(RF24_SPI_PTR)
    status = _spi->transfer(reg);
    while (len--) {
        *buf++ = _spi->transfer(0xFF);
    }

    #else // !defined(RF24_SPI_PTR)
    status = _SPI.transfer(reg);
    while (len--) {
        *buf++ = _SPI.transfer(0xFF);
    }

    #endif // !defined(RF24_SPI_PTR)
    endTransaction();
#endif     // !defined(RF24_LINUX) && !defined(RF24_RP2)
}

