dkyazzentwatwa/cardputer-app-bundle/ESP32-Bit-Pirate/lib/RF24/RF24.cpp
/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg)
{
    uint8_t result;

#if defined(RF24_LINUX) || defined(RF24_RP2)
    beginTransaction();

    uint8_t* prx = spi_rxbuff;
    uint8_t* ptx = spi_txbuff;
    *ptx++ = reg;
    *ptx++ = nRF24L01::NOP; // Dummy operation, just for reading

    #if defined(RF24_RP2)
    _spi->transfernb((const uint8_t*)spi_txbuff, spi_rxbuff, 2);
    #else  // !defined(RF24_RP2)
    _SPI.transfernb(reinterpret_cast<char*>(spi_txbuff), reinterpret_cast<char*>(spi_rxbuff), 2);
    #endif // !defined(RF24_RP2)

    status = *prx;   // status is 1st byte of receive buffer
    result = *++prx; // result is 2nd byte of receive buffer

    endTransaction();
#else // !defined(RF24_LINUX) && !defined(RF24_RP2)

    beginTransaction();
    #if defined(RF24_SPI_PTR)
    status = _spi->transfer(reg);
    result = _spi->transfer(0xff);

    #else // !defined(RF24_SPI_PTR)
    status = _SPI.transfer(reg);
    result = _SPI.transfer(0xff);

    #endif // !defined(RF24_SPI_PTR)
    endTransaction();
#endif     // !defined(RF24_LINUX) && !defined(RF24_RP2)

    return result;
}

/****************************************************************************/

void RF24::write_register(uint8_t reg, const uint8_t* buf, uint8_t len)
{
#if defined(RF24_LINUX) || defined(RF24_RP2)
    beginTransaction();
    uint8_t* prx = spi_rxbuff;
    uint8_t* ptx = spi_txbuff;
    uint8_t size = static_cast<uint8_t>(len + 1); // Add register value to transmit buffer

    *ptx++ = (nRF24L01::W_REGISTER | reg);
    while (len--) {
        *ptx++ = *buf++;
    }

    #if defined(RF24_RP2)
    _spi->transfernb((const uint8_t*)spi_txbuff, spi_rxbuff, size);
    #else  // !defined(RF24_RP2)
    _SPI.transfernb(reinterpret_cast<char*>(spi_txbuff), reinterpret_cast<char*>(spi_rxbuff), size);
    #endif // !defined(RF24_RP2)

    status = *prx; // status is 1st byte of receive buffer
    endTransaction();
#else // !defined(RF24_LINUX) && !defined(RF24_RP2)

    beginTransaction();
    #if defined(RF24_SPI_PTR)
    status = _spi->transfer(nRF24L01::W_REGISTER | reg);
    while (len--) {
        _spi->transfer(*buf++);
    }

    #else // !defined(RF24_SPI_PTR)
    status = _SPI.transfer(nRF24L01::W_REGISTER | reg);
    while (len--) {
        _SPI.transfer(*buf++);
    }

    #endif // !defined(RF24_SPI_PTR)
    endTransaction();
#endif     // !defined(RF24_LINUX) && !defined(RF24_RP2)
}

/****************************************************************************/

void RF24::write_register(uint8_t reg, uint8_t value)
{
    IF_RF24_DEBUG(printf_P(PSTR("write_register(%02x,%02x)\r\n"), reg, value));
#if defined(RF24_LINUX) || defined(RF24_RP2)
    beginTransaction();
    uint8_t* prx = spi_rxbuff;
    uint8_t* ptx = spi_txbuff;
    *ptx++ = (nRF24L01::W_REGISTER | reg);
    *ptx = value;

    #if defined(RF24_RP2)
    _spi->transfernb((const uint8_t*)spi_txbuff, spi_rxbuff, 2);
    #else  // !defined(RF24_RP2)
    _SPI.transfernb(reinterpret_cast<char*>(spi_txbuff), reinterpret_cast<char*>(spi_rxbuff), 2);
    #endif // !defined(RF24_RP2)

    status = *prx++; // status is 1st byte of receive buffer
    endTransaction();
#else // !defined(RF24_LINUX) && !defined(RF24_RP2)

    beginTransaction();
    #if defined(RF24_SPI_PTR)
    status = _spi->transfer(nRF24L01::W_REGISTER | reg);
    _spi->transfer(value);
    #else  // !defined(RF24_SPI_PTR)
    status = _SPI.transfer(nRF24L01::W_REGISTER | reg);
    _SPI.transfer(value);
    #endif // !defined(RF24_SPI_PTR)
    endTransaction();
#endif     // !defined(RF24_LINUX) && !defined(RF24_RP2)
}

/****************************************************************************/

void RF24::write_payload(const void* buf, uint8_t data_len, const uint8_t writeType)
{
    const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);

    uint8_t blank_len = !data_len ? 1 : 0;
    if (!dynamic_payloads_enabled) {
        data_len = rf24_min(data_len, payload_size);
        blank_len = static_cast<uint8_t>(payload_size - data_len);
    }
    else {
        data_len = rf24_min(data_len, static_cast<uint8_t>(32));
    }

    //printf("[Writing %u bytes %u blanks]",data_len,blank_len);
    IF_RF24_DEBUG(printf_P("[Writing %u bytes %u blanks]\n", data_len, blank_len););

#if defined(RF24_LINUX) || defined(RF24_RP2)
    beginTransaction();
    uint8_t* prx = spi_rxbuff;
    uint8_t* ptx = spi_txbuff;
    uint8_t size;
    size = static_cast<uint8_t>(data_len + blank_len + 1); // Add register value to transmit buffer

    *ptx++ = writeType;
    while (data_len--) {
        *ptx++ = *current++;
    }

    while (blank_len--) {
        *ptx++ = 0;
    }

    #if defined(RF24_RP2)
    _spi->transfernb((const uint8_t*)spi_txbuff, spi_rxbuff, size);
    #else  // !defined(RF24_RP2)
    _SPI.transfernb(reinterpret_cast<char*>(spi_txbuff), reinterpret_cast<char*>(spi_rxbuff), size);
    #endif // !defined(RF24_RP2)

    status = *prx; // status is 1st byte of receive buffer
    endTransaction();

#else // !defined(RF24_LINUX) && !defined(RF24_RP2)

    beginTransaction();
    #if defined(RF24_SPI_PTR)
    status = _spi->transfer(writeType);
    while (data_len--) {
        _spi->transfer(*current++);
    }

    while (blank_len--) {
        _spi->transfer(0);
    }

    #else // !defined(RF24_SPI_PTR)
    status = _SPI.transfer(writeType);
    while (data_len--) {
        _SPI.transfer(*current++);
    }

    while (blank_len--) {
        _SPI.transfer(0);
    }

    #endif // !defined(RF24_SPI_PTR)
    endTransaction();
#endif     // !defined(RF24_LINUX) && !defined(RF24_RP2)
}

/****************************************************************************/

void RF24::read_payload(void* buf, uint8_t data_len)
{
    uint8_t* current = reinterpret_cast<uint8_t*>(buf);

    uint8_t blank_len = 0;
    if (!dynamic_payloads_enabled) {
        data_len = rf24_min(data_len, payload_size);
        blank_len = static_cast<uint8_t>(payload_size - data_len);
    }
    else {
        data_len = rf24_min(data_len, static_cast<uint8_t>(32));
    }

    //printf("[Reading %u bytes %u blanks]",data_len,blank_len);

    IF_RF24_DEBUG(printf_P("[Reading %u bytes %u blanks]\n", data_len, blank_len););

