dkyazzentwatwa/cardputer-app-bundle/ESP32-Bit-Pirate/lib/RF24/RF24.cpp
/****************************************************************************/

bool RF24::isChipConnected()
{
    return read_register(nRF24L01::SETUP_AW) == (addr_width - static_cast<uint8_t>(2));
}

/****************************************************************************/

bool RF24::isValid()
{
    return ce_pin != RF24_PIN_INVALID && csn_pin != RF24_PIN_INVALID;
}

/****************************************************************************/

void RF24::startListening(void)
{
#if !defined(RF24_TINY) && !defined(LITTLEWIRE)
    powerUp();
#endif
    config_reg |= _BV(nRF24L01::PRIM_RX);
    write_register(nRF24L01::CONFIG, config_reg);
    write_register(nRF24L01::STATUS, RF24_IRQ_ALL);
    ce(HIGH);

    // Restore the pipe0 address, if exists
    if (_is_p0_rx) {
        write_register(nRF24L01::RX_ADDR_P0, pipe0_reading_address, addr_width);
    }
    else {
        closeReadingPipe(0);
    }
}

/****************************************************************************/

static const PROGMEM uint8_t child_pipe_enable[] = {nRF24L01::ERX_P0, nRF24L01::ERX_P1, nRF24L01::ERX_P2,
                                                    nRF24L01::ERX_P3, nRF24L01::ERX_P4, nRF24L01::ERX_P5};

void RF24::stopListening(void)
{
    ce(LOW);

    //delayMicroseconds(100);
    delayMicroseconds(static_cast<int>(txDelay));
    if (ack_payloads_enabled) {
        flush_tx();
    }

    config_reg = static_cast<uint8_t>(config_reg & ~_BV(nRF24L01::PRIM_RX));
    write_register(nRF24L01::CONFIG, config_reg);

#if defined(RF24_TINY) || defined(LITTLEWIRE)
    // for 3 pins solution TX mode is only left with additional powerDown/powerUp cycle
    if (ce_pin == csn_pin) {
        powerDown();
        powerUp();
    }
#endif
    write_register(nRF24L01::RX_ADDR_P0, pipe0_writing_address, addr_width);
    write_register(nRF24L01::EN_RXADDR, static_cast<uint8_t>(read_register(nRF24L01::EN_RXADDR) | _BV(pgm_read_byte(&child_pipe_enable[0])))); // Enable RX on pipe0
}

/****************************************************************************/

void RF24::stopListening(const uint64_t txAddress)
{
    memcpy(pipe0_writing_address, &txAddress, addr_width);
    stopListening();
    write_register(nRF24L01::TX_ADDR, pipe0_writing_address, addr_width);
}

/****************************************************************************/

void RF24::stopListening(const uint8_t* txAddress)
{
    memcpy(pipe0_writing_address, txAddress, addr_width);
    stopListening();
    write_register(nRF24L01::TX_ADDR, pipe0_writing_address, addr_width);
}

/****************************************************************************/

void RF24::powerDown(void)
{
    ce(LOW); // Guarantee CE is low on powerDown
    config_reg = static_cast<uint8_t>(config_reg & ~_BV(nRF24L01::PWR_UP));
    write_register(nRF24L01::CONFIG, config_reg);
}

/****************************************************************************/

//Power up now. Radio will not power down unless instructed by MCU for config changes etc.
void RF24::powerUp(void)
{
    // if not powered up then power up and wait for the radio to initialize
    if (!(config_reg & _BV(nRF24L01::PWR_UP))) {
        config_reg |= _BV(nRF24L01::PWR_UP);
        write_register(nRF24L01::CONFIG, config_reg);

        // For nRF24L01+ to go from power down mode to TX or RX mode it must first pass through stand-by mode.
        // There must be a delay of Tpd2stby (see Table 16.) after the nRF24L01+ leaves power down mode before
        // the CEis set high. - Tpd2stby can be up to 5ms per the 1.0 datasheet
        delayMicroseconds(RF24_POWERUP_DELAY);
    }
}

/******************************************************************/
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)

void RF24::errNotify()
{
    #if defined(RF24_DEBUG) || defined(RF24_LINUX)
    printf_P(PSTR("RF24 HARDWARE FAIL: Radio not responding, verify pin connections, wiring, etc.\r\n"));
    #endif
    #if defined(FAILURE_HANDLING)
    failureDetected = 1;
    #else
    delay(5000);
    #endif
}

/******************************************************************/

int8_t RF24::errHandler(bool* doRecovery)
{

    //Wait until complete or failed
    uint32_t timer = millis();

    while (!(update() & (RF24_TX_DS | RF24_TX_DF))) {
        if (millis() - timer > 95) {
    #if defined(FAILURE_HANDLING)
            flush_rx();
            flush_tx();
            if (doRecovery) {
                *doRecovery = false;
                failureRecoveryAttempts++;
                ce(LOW);
                return -1;
            }
            else {
    #endif
                errNotify();
    #if defined(FAILURE_HANDLING)
            }
            return 0;
    #else
            delay(100);
    #endif
        }
    }
    return 0;
}

/******************************************************************/

void RF24::errHandler()
{

    #if defined(FAILURE_HANDLING)
    flush_tx();
    flush_rx();
    if (!failureFlushed) {
        failureFlushed = true;
        failureRecoveryAttempts++;
    }
    else {
    #endif
        errNotify();
    #if defined(FAILURE_HANDLING)
        failureFlushed = false;
    }
    ce(LOW);
    #endif
}

#endif

/******************************************************************/

//Similar to the previous write, clears the interrupt flags
bool RF24::write(const void* buf, uint8_t len, const bool multicast)
{

    //Start Writing
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    bool doRecovery = true;
    do {
#endif
        startFastWrite(buf, len, multicast);
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    } while (errHandler(&doRecovery) < 0);
#endif

    ce(LOW);

    write_register(nRF24L01::STATUS, RF24_IRQ_ALL);

    //Max retries exceeded
    if (status & RF24_TX_DF) {
        flush_tx(); // Only going to be 1 packet in the FIFO at a time using this method, so just flush
        return 0;
    }
    //TX OK 1 or 0
    return 1;
}

/****************************************************************************/

