dkyazzentwatwa/cardputer-app-bundle/ESP32-Bit-Pirate/lib/RF24/RF24.cpp
bool RF24::write(const void* buf, uint8_t len)
{
    return write(buf, len, 0);
}

/****************************************************************************/

//For general use, the interrupt flags are not important to clear
bool RF24::writeBlocking(const void* buf, uint8_t len, uint32_t timeout)
{
    //Block until the FIFO is NOT full.
    //Keep track of the MAX retries and set auto-retry if seeing failures
    //This way the FIFO will fill up and allow blocking until packets go through
    //The radio will auto-clear everything in the FIFO as long as CE remains high
#if defined(FAILURE_HANDLING)
    bool timeoutInvoked = false;
#endif

    uint32_t timer = millis(); // Get the time that the payload transmission started

    while (update() & _BV(nRF24L01::TX_FULL)) { // Blocking only if FIFO is full. This will loop and block until TX is successful or timeout

        if (status & RF24_TX_DF) { // If MAX Retries have been reached
            reUseTX();             // Set re-transmit and clear the MAX_RT interrupt flag
            if (millis() - timer > timeout) {
#if defined(FAILURE_HANDLING)
                failureFlushed = false;
#endif
                return 0; // If this payload has exceeded the user-defined timeout, exit and return 0
            }
        }
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (millis() - timer > (timeout + 95)) {
            errHandler();
    #if defined(FAILURE_HANDLING)
            timeoutInvoked = true;
            if (!failureFlushed) {
    #endif
                return 0;
    #if defined(FAILURE_HANDLING)
            }
    #endif
        }
#endif
    }

    //Start Writing
    startFastWrite(buf, len, 0); // Write the payload if a buffer is clear
#if defined(FAILURE_HANDLING)
    if (!timeoutInvoked) {
        failureFlushed = false;
    }
#endif
    return 1; // Return 1 to indicate successful transmission
}

/****************************************************************************/

void RF24::reUseTX()
{
    ce(LOW);
    write_register(nRF24L01::STATUS, RF24_TX_DF); //Clear max retry flag
    read_register(nRF24L01::REUSE_TX_PL, (uint8_t*)nullptr, 0);
    IF_RF24_DEBUG(printf_P("[Reusing payload in TX FIFO]"););
    ce(HIGH); //Re-Transfer packet
}

/****************************************************************************/

bool RF24::writeFast(const void* buf, uint8_t len, const bool multicast)
{
    //Block until the FIFO is NOT full.
    //Keep track of the MAX retries and set auto-retry if seeing failures
    //Return 0 so the user can control the retries and set a timer or failure counter if required
    //The radio will auto-clear everything in the FIFO as long as CE remains high

#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    uint32_t timer = millis();
    bool timeoutInvoked = false;
#endif

    //Blocking only if FIFO is full. This will loop and block until TX is successful or fail
    while (update() & _BV(nRF24L01::TX_FULL)) {
        if (status & RF24_TX_DF) {
#if defined(FAILURE_HANDLING)
            failureFlushed = false;
#endif
            return 0; //Return 0. The previous payload has not been retransmitted
            // From the user perspective, if you get a 0, call txStandBy()
        }
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (millis() - timer > 95) {
            timeoutInvoked = true;
            errHandler();
    #if defined(FAILURE_HANDLING)
            if (!failureFlushed) {
    #endif
                return 0;
    #if defined(FAILURE_HANDLING)
            }
    #endif
        }
#endif
    }
    startFastWrite(buf, len, multicast); // Start Writing
#if defined(FAILURE_HANDLING)
    if (!timeoutInvoked) {
        failureFlushed = false;
    }
#endif
    return 1;
}

bool RF24::writeFast(const void* buf, uint8_t len)
{
    return writeFast(buf, len, 0);
}

/****************************************************************************/

//Per the documentation, we want to set PTX Mode when not listening. Then all we do is write data and set CE high
//In this mode, if we can keep the FIFO buffers loaded, packets will transmit immediately (no 130us delay)
//Otherwise we enter Standby-II mode, which is still faster than standby mode
//Also, we remove the need to keep writing the config register over and over and delaying for 150 us each time if sending a stream of data

void RF24::startFastWrite(const void* buf, uint8_t len, const bool multicast, bool startTx)
{ //TMRh20

    write_payload(buf, len, multicast ? nRF24L01::W_TX_PAYLOAD_NO_ACK : nRF24L01::W_TX_PAYLOAD);
    if (startTx) {
        ce(HIGH);
    }
}

/****************************************************************************/

//Added the original startWrite back in so users can still use interrupts, ack payloads, etc
//Allows the library to pass all tests
bool RF24::startWrite(const void* buf, uint8_t len, const bool multicast)
{

    // Send the payload
    write_payload(buf, len, multicast ? nRF24L01::W_TX_PAYLOAD_NO_ACK : nRF24L01::W_TX_PAYLOAD);
    ce(HIGH);
#if !defined(F_CPU) || F_CPU > 20000000
    delayMicroseconds(10);
#endif
#ifdef ARDUINO_ARCH_STM32
    if (F_CPU > 20000000) {
        delayMicroseconds(10);
    }
#endif
    ce(LOW);
    return !(status & _BV(nRF24L01::TX_FULL));
}

/****************************************************************************/

bool RF24::rxFifoFull()
{
    return read_register(nRF24L01::FIFO_STATUS) & _BV(nRF24L01::RX_FULL);
}

/****************************************************************************/

rf24_fifo_state_e RF24::isFifo(bool about_tx)
{
    uint8_t state = (read_register(nRF24L01::FIFO_STATUS) >> (4 * about_tx)) & 3;
    return static_cast<rf24_fifo_state_e>(state);
}

/****************************************************************************/

bool RF24::isFifo(bool about_tx, bool check_empty)
{
    return static_cast<bool>(static_cast<uint8_t>(isFifo(about_tx)) & _BV(!check_empty));
}

/****************************************************************************/

bool RF24::txStandBy()
{

#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    uint32_t timeout = millis();
#endif
    while (!(read_register(nRF24L01::FIFO_STATUS) & _BV(nRF24L01::TX_EMPTY))) {
        if (status & RF24_TX_DF) {
            write_register(nRF24L01::STATUS, RF24_TX_DF);
            ce(LOW);
            flush_tx(); //Non blocking, flush the data
#if defined(FAILURE_HANDLING)
            failureFlushed = false;
#endif
            return 0;
        }
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (millis() - timeout > 95) {
            errHandler();
            return 0;
        }
#endif
    }

    ce(LOW); //Set STANDBY-I mode
#if defined(FAILURE_HANDLING)
    failureFlushed = false;
#endif
    return 1;
}

