dkyazzentwatwa/cardputer-app-bundle/ESP32-Bit-Pirate/lib/RF24/RF24.cpp
/****************************************************************************/

bool RF24::txStandBy(uint32_t timeout, bool startTx)
{

    if (startTx) {
        stopListening();
        ce(HIGH);
    }
    uint32_t start = millis();

    while (!(read_register(nRF24L01::FIFO_STATUS) & _BV(nRF24L01::TX_EMPTY))) {
        if (status & RF24_TX_DF) {
            write_register(nRF24L01::STATUS, RF24_TX_DF);
            ce(LOW); // Set re-transmit
            ce(HIGH);
            if (millis() - start >= timeout) {
                ce(LOW);
                flush_tx();
#if defined(FAILURE_HANDLING)
                failureFlushed = false;
#endif
                return 0;
            }
        }
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (millis() - start > timeout + 95) {
            errHandler();
            return 0;
        }
#endif
    }

    ce(LOW); //Set STANDBY-I mode
#if defined(FAILURE_HANDLING)
    failureFlushed = false;
#endif
    return 1;
}

/****************************************************************************/

void RF24::maskIRQ(bool tx, bool fail, bool rx)
{
    /* clear the interrupt flags */
    config_reg = static_cast<uint8_t>(config_reg & ~(1 << nRF24L01::MASK_MAX_RT | 1 << nRF24L01::MASK_TX_DS | 1 << nRF24L01::MASK_RX_DR));
    /* set the specified interrupt flags */
    config_reg = static_cast<uint8_t>(config_reg | fail << nRF24L01::MASK_MAX_RT | tx << nRF24L01::MASK_TX_DS | rx << nRF24L01::MASK_RX_DR);
    write_register(nRF24L01::CONFIG, config_reg);
}

/****************************************************************************/

uint8_t RF24::getDynamicPayloadSize(void)
{
    uint8_t result = read_register(nRF24L01::R_RX_PL_WID);

    if (result > 32 || !result) {
        flush_rx();
        return 0;
    }
    return result;
}

/****************************************************************************/

bool RF24::available(void)
{
    return (read_register(nRF24L01::FIFO_STATUS) & 1) == 0;
}

/****************************************************************************/

bool RF24::available(uint8_t* pipe_num)
{
    if (available()) { // if RX FIFO is not empty
        *pipe_num = (update() >> nRF24L01::RX_P_NO) & 0x07;
        return 1;
    }
    return 0;
}

/****************************************************************************/

void RF24::read(void* buf, uint8_t len)
{

    // Fetch the payload
    read_payload(buf, len);

    //Clear the only applicable interrupt flags
    write_register(nRF24L01::STATUS, RF24_RX_DR);
}

/****************************************************************************/

void RF24::whatHappened(bool& tx_ok, bool& tx_fail, bool& rx_ready)
{
    // Read the status & reset the status in one easy call
    // Or is that such a good idea?
    write_register(nRF24L01::STATUS, RF24_IRQ_ALL);

    // Report to the user what happened
    tx_ok = status & RF24_TX_DS;
    tx_fail = status & RF24_TX_DF;
    rx_ready = status & RF24_RX_DR;
}

/****************************************************************************/

uint8_t RF24::clearStatusFlags(uint8_t flags)
{
    write_register(nRF24L01::STATUS, flags & RF24_IRQ_ALL);
    return status;
}

/****************************************************************************/

void RF24::setStatusFlags(uint8_t flags)
{
    // flip the `flags` to translate from "human understanding"
    config_reg = (config_reg & ~RF24_IRQ_ALL) | (~flags & RF24_IRQ_ALL);
    write_register(nRF24L01::CONFIG, config_reg);
}

/****************************************************************************/

uint8_t RF24::getStatusFlags()
{
    return status;
}

/****************************************************************************/

uint8_t RF24::update()
{
    read_register(nRF24L01::NOP, (uint8_t*)nullptr, 0);
    return status;
}

/****************************************************************************/

void RF24::openWritingPipe(uint64_t value)
{
    // Note that AVR 8-bit uC's store this LSB first, and the NRF24L01(+)
    // expects it LSB first too, so we're good.

    write_register(nRF24L01::RX_ADDR_P0, reinterpret_cast<uint8_t*>(&value), addr_width);
    write_register(nRF24L01::TX_ADDR, reinterpret_cast<uint8_t*>(&value), addr_width);
    memcpy(pipe0_writing_address, &value, addr_width);
}

/****************************************************************************/

void RF24::openWritingPipe(const uint8_t* address)
{
    // Note that AVR 8-bit uC's store this LSB first, and the NRF24L01(+)
    // expects it LSB first too, so we're good.
    write_register(nRF24L01::RX_ADDR_P0, address, addr_width);
    write_register(nRF24L01::TX_ADDR, address, addr_width);
    memcpy(pipe0_writing_address, address, addr_width);
}

/****************************************************************************/

static const PROGMEM uint8_t child_pipe[] = {nRF24L01::RX_ADDR_P0, nRF24L01::RX_ADDR_P1, nRF24L01::RX_ADDR_P2,
                                             nRF24L01::RX_ADDR_P3, nRF24L01::RX_ADDR_P4, nRF24L01::RX_ADDR_P5};

void RF24::openReadingPipe(uint8_t child, uint64_t address)
{
    // If this is pipe 0, cache the address.  This is needed because
    // openWritingPipe() will overwrite the pipe 0 address, so
    // startListening() will have to restore it.
    if (child == 0) {
        memcpy(pipe0_reading_address, &address, addr_width);
        _is_p0_rx = true;
    }

    if (child <= 5) {
        // For pipes 2-5, only write the LSB
        if (child > 1) {
            write_register(pgm_read_byte(&child_pipe[child]), reinterpret_cast<const uint8_t*>(&address), 1);
        }
        // avoid overwriting the TX address on pipe 0 while still in TX mode.
        // NOTE, the cached RX address on pipe 0 is written when startListening() is called.
        else if (static_cast<bool>(config_reg & _BV(nRF24L01::PRIM_RX)) || child != 0) {
            write_register(pgm_read_byte(&child_pipe[child]), reinterpret_cast<const uint8_t*>(&address), addr_width);
        }

        // Note it would be more efficient to set all of the bits for all open
        // pipes at once.  However, I thought it would make the calling code
        // more simple to do it this way.
        write_register(nRF24L01::EN_RXADDR, static_cast<uint8_t>(read_register(nRF24L01::EN_RXADDR) | _BV(pgm_read_byte(&child_pipe_enable[child]))));
    }
}

